7767517
176 205
Input                    in0                      0 1 in0
MemoryData               pnnx_5                   0 1 1 0=64 1=64
MemoryData               pnnx_6                   0 1 2 0=64 1=64
MemoryData               pnnx_10                  0 1 3 0=64 1=64
Padding                  zeropad_97               1 1 in0 4 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00
Convolution              convclip_7               1 1 4 5 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=864 9=3
ConvolutionDepthWise     convdwclip_0             1 1 5 6 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=3
Convolution              conv_6                   1 1 6 7 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Convolution              convclip_8               1 1 7 8 0=96 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=3
Padding                  zeropad_98               1 1 8 9 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00
ConvolutionDepthWise     convdwclip_1             1 1 9 10 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=864 7=96 9=3
Convolution              conv_8                   1 1 10 11 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Split                    splitncnn_0              1 2 11 12 13
Convolution              convclip_9               1 1 13 14 0=144 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=3
ConvolutionDepthWise     convdwclip_2             1 1 14 15 0=144 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1296 7=144 9=3
Convolution              conv_10                  1 1 15 16 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
BinaryOp                 add_0                    2 1 12 16 17 0=0
Split                    splitncnn_1              1 2 17 18 19
Convolution              convclip_10              1 1 19 20 0=144 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=3
Padding                  zeropad_99               1 1 20 21 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00
ConvolutionDepthWise     convdwclip_3             1 1 21 22 0=144 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=1296 7=144 9=3
Convolution              conv_12                  1 1 22 23 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Split                    splitncnn_2              1 2 23 24 25
Convolution              convclip_11              1 1 25 26 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144 9=3
ConvolutionDepthWise     convdwclip_4             1 1 26 27 0=192 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192 9=3
Convolution              conv_14                  1 1 27 28 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
BinaryOp                 add_1                    2 1 24 28 29 0=0
Split                    splitncnn_3              1 2 29 30 31
Convolution              convclip_12              1 1 31 32 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144 9=3
ConvolutionDepthWise     convdwclip_5             1 1 32 33 0=192 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192 9=3
Convolution              conv_16                  1 1 33 34 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
BinaryOp                 add_2                    2 1 30 34 35 0=0
Split                    splitncnn_4              1 2 35 36 37
Convolution              convclip_13              1 1 37 38 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144 9=3
Padding                  zeropad_100              1 1 38 39 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00
ConvolutionDepthWise     convdwclip_6             1 1 39 40 0=192 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=1728 7=192 9=3
Convolution              conv_18                  1 1 40 41 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Split                    splitncnn_5              1 2 41 42 43
Convolution              convclip_14              1 1 43 44 0=384 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=3
ConvolutionDepthWise     convdwclip_7             1 1 44 45 0=384 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456 7=384 9=3
Convolution              conv_20                  1 1 45 46 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
BinaryOp                 add_3                    2 1 42 46 47 0=0
Split                    splitncnn_6              1 2 47 48 49
Convolution              convclip_15              1 1 49 50 0=384 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=3
ConvolutionDepthWise     convdwclip_8             1 1 50 51 0=384 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456 7=384 9=3
Convolution              conv_22                  1 1 51 52 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
BinaryOp                 add_4                    2 1 48 52 53 0=0
Split                    splitncnn_7              1 2 53 54 55
Convolution              convclip_16              1 1 55 56 0=384 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=3
ConvolutionDepthWise     convdwclip_9             1 1 56 57 0=384 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456 7=384 9=3
Convolution              conv_24                  1 1 57 58 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
BinaryOp                 add_5                    2 1 54 58 59 0=0
Split                    splitncnn_8              1 2 59 60 61
Convolution              convclip_17              1 1 61 62 0=384 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=3
ConvolutionDepthWise     convdwclip_10            1 1 62 63 0=384 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456 7=384 9=3
Convolution              conv_26                  1 1 63 64 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Split                    splitncnn_9              1 2 64 65 66
Convolution              convclip_18              1 1 66 67 0=576 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296 9=3
ConvolutionDepthWise     convdwclip_11            1 1 67 68 0=576 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576 9=3
Convolution              conv_28                  1 1 68 69 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_6                    2 1 65 69 70 0=0
Split                    splitncnn_10             1 2 70 71 72
Convolution              convclip_19              1 1 72 73 0=576 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296 9=3
ConvolutionDepthWise     convdwclip_12            1 1 73 74 0=576 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576 9=3
Convolution              conv_30                  1 1 74 75 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_7                    2 1 71 75 76 0=0
Convolution              convclip_20              1 1 76 77 0=576 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296 9=3
Padding                  zeropad_101              1 1 77 78 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00
ConvolutionDepthWise     convdwclip_13            1 1 78 79 0=576 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=5184 7=576 9=3
Convolution              conv_32                  1 1 79 80 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=92160
Split                    splitncnn_11             1 2 80 81 82
Convolution              convclip_21              1 1 82 83 0=960 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600 9=3
ConvolutionDepthWise     convdwclip_14            1 1 83 84 0=960 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=8640 7=960 9=3
Convolution              conv_34                  1 1 84 85 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
BinaryOp                 add_8                    2 1 81 85 86 0=0
Split                    splitncnn_12             1 2 86 87 88
Convolution              convclip_22              1 1 88 89 0=960 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600 9=3
ConvolutionDepthWise     convdwclip_15            1 1 89 90 0=960 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=8640 7=960 9=3
Convolution              conv_36                  1 1 90 91 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
BinaryOp                 add_9                    2 1 87 91 92 0=0
Convolution              convclip_23              1 1 92 93 0=960 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600 9=3
ConvolutionDepthWise     convdwclip_16            1 1 93 94 0=960 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=8640 7=960 9=3
Convolution              conv_38                  1 1 94 95 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=307200
Convolution              convclip_24              1 1 95 96 0=1280 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600 9=3
Convolution              conv_40                  1 1 96 97 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=81920
Interp                   upsample_2               1 1 97 98 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_41                  1 1 60 99 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_10                   2 1 99 98 100 0=0
ConvolutionDepthWise     convdw_145               1 1 100 101 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              convrelu_0               1 1 101 102 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Interp                   upsample_3               1 1 102 103 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_43                  1 1 36 104 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
BinaryOp                 add_11                   2 1 104 103 105 0=0
ConvolutionDepthWise     convdw_146               1 1 105 106 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Convolution              convrelu_1               1 1 106 107 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768 9=1
Interp                   upsample_4               1 1 107 108 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_45                  1 1 18 109 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
BinaryOp                 add_12                   2 1 109 108 110 0=0
ConvolutionDepthWise     convdw_147               1 1 110 111 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
Convolution              convrelu_2               1 1 111 112 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Split                    splitncnn_13             1 4 112 113 114 115 116
ConvolutionDepthWise     convdw_148               1 1 116 117 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
ConvolutionDepthWise     convdw_149               1 1 115 118 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
ConvolutionDepthWise     convdw_150               1 1 114 119 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
ConvolutionDepthWise     convdw_151               1 1 113 120 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
Convolution              convrelu_3               1 1 119 121 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              conv_52                  1 1 121 122 0=17 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1632
Convolution              convrelu_4               1 1 117 123 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              conv_48                  1 1 123 124 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=96
Convolution              convrelu_5               1 1 118 125 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              conv_50                  1 1 125 126 0=34 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3264
Convolution              convrelu_6               1 1 120 127 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              conv_54                  1 1 127 128 0=34 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3264
Squeeze                  squeeze_117              1 1 124 129
Sigmoid                  sigmoid_0                1 1 129 130
BinaryOp                 mul_13                   2 1 130 3 131 0=2
Reshape                  view_108                 1 1 131 132 0=4096 1=1
torch.argmax             torch.argmax_19          1 1 132 133
Split                    splitncnn_14             1 4 133 134 135 136 137
BinaryOp                 div_14                   1 1 135 138 0=3 1=1 2=4.800000e+01
Split                    splitncnn_15             1 2 138 139 140
BinaryOp                 mul_15                   1 1 140 141 0=2 1=1 2=4.800000e+01
BinaryOp                 sub_16                   2 1 136 141 142 0=1
pnnx.Expression          pnnx_expr_79             1 1 134 143
ExpandDims               unsqueeze_125            1 1 137 144
Tensor.expand            Tensor.expand_5          2 1 144 143 145
Squeeze                  squeeze_118              1 1 126 146
Reshape                  view_109                 1 1 146 147 0=2 1=17 2=-1
torch.gather             torch.gather_23          2 1 147 145 148
Concat                   cat_0                    2 1 139 142 149 0=1
Squeeze                  squeeze_120              1 1 148 150 -23303=1,0
BinaryOp                 add_17                   2 1 150 149 151 0=0
Split                    splitncnn_16             1 2 151 152 153
Crop                     select_0                 1 1 152 154 -23310=1,1 -23311=1,1 -23309=1,0
Reshape                  reshape_102              1 1 154 155
Reshape                  reshape_103              1 1 155 156 0=17 1=1 2=1
BinaryOp                 sub_18                   2 1 2 156 157 0=1
Split                    splitncnn_17             1 2 157 158 159
Crop                     select_1                 1 1 153 160 -23310=1,2 -23311=1,1 -23309=1,1
Reshape                  reshape_104              1 1 160 161
Reshape                  reshape_105              1 1 161 162 0=17 1=1 2=1
BinaryOp                 sub_19                   2 1 1 162 163 0=1
Split                    splitncnn_18             1 2 163 164 165
BinaryOp                 mul_20                   2 1 164 165 166 0=2
BinaryOp                 mul_21                   2 1 158 159 167 0=2
BinaryOp                 add_22                   2 1 167 166 168 0=0
UnaryOp                  sqrt_23                  1 1 168 169 0=5
BinaryOp                 add_24                   1 1 169 170 0=0 1=1 2=1.800000e+00
Squeeze                  squeeze_116              1 1 122 171
Sigmoid                  sigmoid_1                1 1 171 172
Split                    splitncnn_19             1 2 172 173 174
BinaryOp                 div_25                   2 1 173 170 175 0=3
Reshape                  reshape_106              1 1 175 176 0=17 1=4096 2=1
torch.argmax             torch.argmax_20          1 1 176 177
Split                    splitncnn_20             1 5 177 178 179 180 181 182
BinaryOp                 div_26                   1 1 180 183 0=3 1=1 2=6.400000e+01
Split                    splitncnn_21             1 2 183 184 185
BinaryOp                 mul_27                   1 1 184 186 0=2 1=1 2=6.400000e+01
BinaryOp                 sub_28                   2 1 181 186 187 0=1
Reshape                  view_110                 1 1 174 188 0=17 1=-1
torch.gather             torch.gather_24          2 1 188 178 189
pnnx.Expression          pnnx_expr_11             1 1 179 190
ExpandDims               unsqueeze_126            1 1 182 191 -23303=1,2
Tensor.expand            Tensor.expand_6          2 1 191 190 192
Squeeze                  squeeze_119              1 1 128 193
Reshape                  view_111                 1 1 193 194 0=2 1=17 2=-1
torch.gather             torch.gather_25          2 1 194 192 195
Squeeze                  squeeze_122              1 1 185 196 -23303=1,0
Squeeze                  squeeze_121              1 1 187 197 -23303=1,0
torch.stack              torch.stack_35           2 1 196 197 198
Squeeze                  squeeze_123              1 1 195 199 -23303=1,0
BinaryOp                 add_29                   2 1 199 198 200 0=0
BinaryOp                 mul_30                   1 1 200 201 0=2 1=1 2=1.562500e-02
Squeeze                  squeeze_124              1 1 189 202 -23303=1,0
ExpandDims               unsqueeze_127            1 1 202 203 -23303=1,1
Concat                   cat_1                    2 1 201 203 out0 0=1
